apps_admin/models/ZdhHotelOrder.php

    public function getOrderList($_params = [])
    {
        if (!empty($_params['search']) && !empty($_params['order_time_from']) && !empty($_params['order_time_to'])) {
            $Where = 'acid = ' . $_params['acid'] . ' and order_on = ' . $_params['search'] . ' and order_time >=' . $_params['order_time_from'] . ' and order_time <=' . $_params['order_time_to'];
        } else if (!empty($_params['order_time_from']) && !empty($_params['order_time_to'])) {
            $Where = 'acid = ' . $_params['acid'] . ' and order_time >=' . $_params['order_time_from'] . ' and order_time <=' . $_params['order_time_to'];
        } else if (!empty($_params['search'])) {
            $Where = 'acid = ' . $_params['acid'] . ' and order_on = ' . $_params['search'];
        } else {
            $Where = 'acid = ' . $_params['acid'];
        }

        if (88 != $_params['order_type']) {
            $Where .= ' and order_status = ' . $_params['order_type'];
        }

        $Query = (new Query())->select('order_id,order_on,goods_name,real_name,phone,totalc_price,order_status,order_time,actual_arrival_time')
            ->from('zdh_hotel_order')
            ->where($Where)->orderBy("order_time DESC")->offset($_params['offset'])->limit($_params['limit']);

        $C_Query = clone $Query;
        $Raws['count'] = $C_Query->count();
        $Raws['data'] = $Query->all();
---
SELECT COUNT(*) FROM `zdh_hotel_order` WHERE acid = 3 and order_status = 3 ORDER BY `order_time` DESC
SELECT `order_id`, `order_on`, `goods_name`, `real_name`, `phone`, `totalc_price`, `order_status`, `order_time` FROM `zdh_hotel_order` WHERE acid = 3 and order_status = 3 ORDER BY `order_time` DESC LIMIT 10

    public function getOrderDetail($_params = [])
    {
        $Raw = (new Query())->select('zo.order_on,zo.order_status,zu.nickname,zh.title,zr.room_type_name,zo.room_count,zo.totalc_price,
        zo.real_name,zo.phone,zo.checkin_time,zo.checkout_time,zo.order_time,zo.arrival_time,zo.goods_name,zo.pay_type,zo.actual_arrival_time,zp.checkout_timeset')->from(['zo' => 'zdh_hotel_order'])
            ->leftJoin(['zu' => 'zdh_wx_user'], 'zo.open_id = zu.open_id')
            ->leftJoin(['zh' => 'zdh_hotel'], 'zh.acid = zo.acid')
            ->leftJoin(['zr' => 'zdh_hotel_order_room'], 'zo.order_on = zr.order_on')
            ->leftJoin(['zp' => 'zdh_hotel_room_type_price'], 'zo.goods_id = zp.room_type_id')
            ->where('zo.order_id = ' . $_params['orders_id'] . ' and zo.acid = ' . $_params['acid'])
            ->one();
---
SELECT `zo`.`order_on`, `zo`.`order_status`, `zu`.`nickname`, `zh`.`title`, `zr`.`room_type_name`, `zo`.`room_count`, `zo`.`totalc_price`, `zo`.`real_name`, `zo`.`phone`, `zo`.`checkin_time`, `zo`.`checkout_time`, `zo`.`order_time`, `zo`.`pay_type` FROM `zdh_hotel_order` `zo` LEFT JOIN `zdh_wx_user` `zu` ON zo.uid = zu.uid LEFT JOIN `zdh_hotel` `zh` ON zh.acid = zo.acid LEFT JOIN `zdh_hotel_order_room` `zr` ON zo.order_on = zr.order_on WHERE zo.order_id = 2 and zo.acid = 3