apps_wechat/controllers/OrderController.php

    public function actionBooking()
    {
        $room_type_id = Yii::$app->request->get('room_type_id');
        $model = RoomType::find()->joinWith('roomTypes')->where(['zdh_hotel_room_type.id' => $room_type_id])->asArray()->one();
---
SELECT `zdh_hotel_room_type`.* FROM `zdh_hotel_room_type` LEFT JOIN `zdh_hotel_room_type_price` ON `zdh_hotel_room_type`.`id` = `zdh_hotel_room_type_price`.`room_type_id` WHERE `zdh_hotel_room_type`.`id`='11'

    public function actionCreateOrder()
    {
        if (Yii::$app->request->isPost) {
            $model = new Order();
            $roomType = RoomType::find()->innerJoinWith(['roomTypes'])->where(['zdh_hotel_room_type.id' => $this->post('room_type_id')])->one();
---
SELECT `zdh_hotel_room_type`.* FROM `zdh_hotel_room_type` INNER JOIN `zdh_hotel_room_type_price` ON `zdh_hotel_room_type`.`id` = `zdh_hotel_room_type_price`.`room_type_id` WHERE `zdh_hotel_room_type`.`id`='11'